ex07_1/ex07-no-code.org
*** Output
#+RESULTS:
|  A |  : |    |    |    |
|  1 |  2 |  3 |  4 |  5 |
|  6 |  7 |  8 |  9 | 10 |
| 11 | 12 | 13 | 14 | 15 |
| 16 | 17 | 18 | 19 | 20 |
|    |    |    |    |    |
| B: |    |    |    |    |
|  1 |  2 |  3 |  4 |  5 |
|  6 |  7 |  8 |  9 | 10 |
| 11 | 12 | 13 | 14 | 15 |
| 16 | 17 | 18 | 19 | 20 |

* Matrix scale
Write a function =mat_scale (a, b, m, n, f)= that maps
every item of a =m x n= matrix =a= by multiplying it by it
by a factor =f= and assignes the result to a matrix =b=. 
#+BEGIN_EXAMPLE
mat_scale (a, f, b)
  for i := 0 to m-1
    for j := 0 to n-1
       b[j,i] := f * a[i,j]
#+END_EXAMPLE
#+LATEX: \linespread{1.2}
** Alogrithm
#+BEGIN_EXAMPLE
  def mat_copy(a,b,m,n,f):
    for i in range(m):
      for j in range(n):
        b[i][j]=f*a[i][j]
#+END_EXAMPLE
** Specification
1. =mat_read()=:
- input: a[][], a 2D integer array, rows, and coloumns.
- output: =a[0:m][0:n]= with values in m rows and n columns.
2. =mat_print()=:
- input: =a[][]=, a 2D integer array, and dimensions of the matrix
- output: none.
3. =mat_scale()=:
- input: =a[][],b[][]=, 2D integer arrays of dimensions mxn and scaling factor f
- output: =b[0:m][0:n]= ,such that =b[i][j]=f*a[i][j]=
** Program
#+BEGIN_SRC C :cmdline <Ex07_6_input.in
  #include<stdio.h>
  void mat_read (int a[50][50], int m, int n)
  {
    for(int i=0;i<m;i++)
      for(int j=0;j<n;j++)
        scanf("%d",&a[i][j]);
  }
  void mat_print(int a[50][50],int m,int n)
  {
    for(int i=0;i<m;i++)
      {
        for(int j=0;j<n;j++)
          printf("%d ",a[i][j]);
        printf("\n");
      }
  }
  void mat_scale(int a[50][50],int b[50][50],int m,int n,int f)
  {
    for(int i=0;i<m;i++)
      for(int j=0;j<n;j++)
        b[i][j]=f*a[i][j];
  }
  int main()
  {
    int a[50][50],b[50][50];
    int m,n,f;
    scanf("%d%d",&m,&n);
    mat_read(a,m,n);
    scanf("%d",&f);
    printf("A :\n");
    mat_print(a,m,n);
    mat_scale(a,b,m,n,f);
    printf("\nB:\n");
    mat_print(b,m,n);
    return 0;
  }

#+END_SRC
** Test
*** Input
#+BEGIN_EXAMPLE
3 3
 9   8   7
 6   5   4
 3   2   1
6
#+END_EXAMPLE

*** Output
#+RESULTS:
|  A |  : |    |
|  9 |  8 |  7 |
|  6 |  5 |  4 |
|  3 |  2 |  1 |
|    |    |    |
| B: |    |    |
| 54 | 48 | 42 |
| 36 | 30 | 24 |
| 18 | 12 |  6 |

* Matrix transpose

Define a function =mat_transpose (a, b, m, n)= that
assigns the transpose of a =m x n= matrix =a= to matrix
=b=. 

The algorithm for transposing a matrix is
#+LATEX: \linespread{1}
#+BEGIN_EXAMPLE
mat_transpose (a, b)
  for i := 0 to m-1
    for j := 0 to n-1
       b[j,i] := a[i,j]
#+END_EXAMPLE
#+LATEX: \linespread{1.2}
It takes two parameters: an input matrix =a= and an output
matrix =b= in which the result is stored.  Thus, the
function intends to use =a= as a read parameter and =b= as
a write paratemeter.
#+LATEX: \linespread{1}
#+LATEX: \linespread{1.2}
However, since arrays are passed by reference, actually
both =a= and =b= are writeable. If someone calls the
function as
#+BEGIN_EXAMPLE
mat_transpose (a, a, m, n)  
#+END_EXAMPLE
in which =a= is read and written, the specification will
not be satisfied.  To avoid =a= being used for read and
write simultaneously, we have to use a temporary matrix to
store the transpose and, after the transpose is
constructed completely, copy it in the output array.

#+LATEX: \linespread{1}
#+LATEX: \linespread{1.2}
** Alogrithm
#+BEGIN_EXAMPLE
  def mat_copy(a,b,m,n):
    for i in range(m):
      for j in range(n):
        b[j[i]=a[i][j]
#+END_EXAMPLE
** Specification
1. =mat_read()=:
- input: a[][], a 2D integer array, rows, and coloumns.
- output: =a[0:m][0:n]= with values in m rows and n columns.
2. =mat_print()=:
- input: =a[][]=, a 2D integer array, and dimensions of the matrix
- output: none.
3. =mat_transpose()=:
- input: =a[][],b[][]=, 2D integer arrays of dimensions mxn 
- output: =b[0:m][0:n]= ,such that =b[j][i]=a[i][j]=
** Program
#+BEGIN_SRC C :cmdline <Ex07_4_input.in
#include<stdio.h>
void mat_read (int a[50][50], int m, int n)
 {
 for(int i=0;i<m;i++)
     for(int j=0;j<n;j++)
       scanf("%d",&a[i][j]);
}
void mat_print(int a[50][50],int m,int n)
{
 for(int i=0;i<m;i++)
  {
   for(int j=0;j<n;j++)
     printf("%d ",a[i][j]);
   printf("\n");
  }
}
void mat_copy(int a[50][50],int b[50][50],int m,int n)
{
for(int i=0;i<m;i++)
     for(int j=0;j<n;j++)
      b[j][i]=a[i][j];
}
int main()
{
int a[50][50],b[50][50];
int m,n;
 scanf("%d%d",&m,&n);
mat_read(a,m,n);
mat_read(b,m,n);
printf("A :\n");
mat_print(a,m,n);
mat_copy(a,b,m,n);
printf("\nB:\n");
mat_print(b,n,m);
return 0;
}

#+END_SRC
** Test
*** Input
#+BEGIN_EXAMPLE
  4 5
  1   2   3   4   5 
  6   7   8   9  10 
 11  12  13  14  15 
 16  17  18  19  20 
#+END_EXAMPLE
  
*** Output
#+RESULTS:
|  A |  : |    |    |    |
|  1 |  2 |  3 |  4 |  5 |
|  6 |  7 |  8 |  9 | 10 |
| 11 | 12 | 13 | 14 | 15 |
| 16 | 17 | 18 | 19 | 20 |
|    |    |    |    |    |
| B: |    |    |    |    |
|  1 |  6 | 11 | 16 |    |
|  2 |  7 | 12 | 17 |    |
|  3 |  8 | 13 | 18 |    |
|  4 |  9 | 14 | 19 |    |
|  5 | 10 | 15 | 20 |    |

* Matrix multiplication
Define a function =mat_mul (a, b, c, m, n, p)= that
multplies an =m x n= matrix =a= and an =n x p= matrix =b=
and assigns the result to a =m x p= matrix =c=.

The algorithm for matrix multiplication is as follows.
#+LATEX: \linespread{1}
#+BEGIN_EXAMPLE
matrix_add (a, b, c)
  for i := 0 to m-1
    for j := 0 to p-1
       // dot product of row i and column j
       c[i,j] := 0;
       for k := 0 to n-1:
          c[i,j] := a[i,k] + b [k,j]
#+END_EXAMPLE
#+LATEX: \linespread{1.2}
To avoid writing =a= or =b=, produce the result in a
temporary array =d=, and after the result is completely
produced, save it in =c=.
#+LATEX: \linespread{1}
** Alogrithm
#+BEGIN_EXAMPLE
  def mat_copy(a,b,c,m,q,p):
    for i in range(m):
      for j in range(q):
          c[i][j]=0
          for k in range(p):
            c[i][j]+=a[i][k]*b[k][j]
     
#+END_EXAMPLE
** Specification
1. =mat_read()=:
- input: a[][], a 2D integer array, rows, and coloumns.
- output: =a[0:m][0:n]= with values in m rows and n columns.
2. =mat_print()=:
- input: =a[][]=, a 2D integer array, and dimensions of the matrix
- output: none.
3. =mat_multiply()=:
- input: =a[][],b[][],c[][]=, 2D integer arrays of dimensions mxn and pxq
- output: =b[0:m][0:n]= ,such that c=axb.
