ex07_1/ex07-no-code.tex
\subsection*{Progarm}
\label{sec-5-3}
\begin{verbatim}
#include<stdio.h>
void mat_read (int a[50][50], int m, int n)
{
  for(int i=0;i<m;i++)
    for(int j=0;j<n;j++)
      scanf("%d",&a[i][j]);
}
void mat_print(int a[50][50],int m,int n)
{
  for(int i=0;i<m;i++)
    {
      for(int j=0;j<n;j++)
	printf("%d ",a[i][j]);
      printf("\n");
    }
}
void mat_copy(int a[50][50],int b[50][50],int m,int n)
{
  for(int i=0;i<m;i++)
    for(int j=0;j<n;j++)
      b[i][j]=a[i][j];
}
int main()
{
  int a[50][50],b[50][50];
  int m,n;
  scanf("%d%d",&m,&n);
  mat_read(a,m,n);
  mat_read(b,m,n);
  printf("A :\n");
  mat_print(a,m,n);
  mat_copy(a,b,m,n);
  printf("\nB:\n");
  mat_print(b,m,n);
  return 0;
}
\end{verbatim}
\subsection*{Test}
\label{sec-5-4}
\subsubsection*{Input}
\label{sec-5-4-1}
\begin{verbatim}
 4 5
 1   2   3   4   5 
 6   7   8   9  10 
11  12  13  14  15 
16  17  18  19  20
\end{verbatim}

\subsubsection*{Output}
\label{sec-5-4-2}
\begin{center}
\begin{tabular}{rrrrr}
A & : &  &  & \\
1 & 2 & 3 & 4 & 5\\
6 & 7 & 8 & 9 & 10\\
11 & 12 & 13 & 14 & 15\\
16 & 17 & 18 & 19 & 20\\
 &  &  &  & \\
B: &  &  &  & \\
1 & 2 & 3 & 4 & 5\\
6 & 7 & 8 & 9 & 10\\
11 & 12 & 13 & 14 & 15\\
16 & 17 & 18 & 19 & 20\\
\end{tabular}
\end{center}

\section{Matrix scale}
\label{sec-6}
Write a function \texttt{mat\_scale (a, b, m, n, f)} that maps
every item of a \texttt{m x n} matrix \texttt{a} by multiplying it by it
by a factor \texttt{f} and assignes the result to a matrix \texttt{b}. 
\begin{verbatim}
mat_scale (a, f, b)
  for i := 0 to m-1
    for j := 0 to n-1
       b[j,i] := f * a[i,j]
\end{verbatim}
\linespread{1.2}
\subsection*{Alogrithm}
\label{sec-6-1}
\begin{verbatim}
def mat_copy(a,b,m,n,f):
  for i in range(m):
    for j in range(n):
      b[i][j]=f*a[i][j]
\end{verbatim}
\subsection*{Specification}
\label{sec-6-2}
\begin{enumerate}
\item \texttt{mat\_read()}:
\item input: a[][], a 2D integer array, rows, and coloumns.
\item output: \texttt{a[0:m][0:n]} with values in m rows and n columns.
\item \texttt{mat\_print()}:
\item input: \texttt{a[][]}, a 2D integer array, and dimensions of the matrix
\item output: none.
\item \texttt{mat\_scale()}:
\item input: \texttt{a[][],b[][]}, 2D integer arrays of dimensions mxn and scaling factor f
\item output: \texttt{b[0:m][0:n]} ,such that \texttt{b[i][j]=f*a[i][j]}
\end{enumerate}
\subsection*{Program}
\label{sec-6-3}
\begin{verbatim}
#include<stdio.h>
void mat_read (int a[50][50], int m, int n)
{
  for(int i=0;i<m;i++)
    for(int j=0;j<n;j++)
      scanf("%d",&a[i][j]);
}
void mat_print(int a[50][50],int m,int n)
{
  for(int i=0;i<m;i++)
    {
      for(int j=0;j<n;j++)
	printf("%d ",a[i][j]);
      printf("\n");
    }
}
void mat_scale(int a[50][50],int b[50][50],int m,int n,int f)
{
  for(int i=0;i<m;i++)
    for(int j=0;j<n;j++)
      b[i][j]=f*a[i][j];
}
int main()
{
  int a[50][50],b[50][50];
  int m,n,f;
  scanf("%d%d",&m,&n);
  mat_read(a,m,n);
  scanf("%d",&f);
  printf("A :\n");
  mat_print(a,m,n);
  mat_scale(a,b,m,n,f);
  printf("\nB:\n");
  mat_print(b,m,n);
  return 0;
}
\end{verbatim}
\subsection*{Test}
\label{sec-6-4}
\subsubsection*{Input}
\label{sec-6-4-1}
\begin{verbatim}
3 3
 9   8   7
 6   5   4
 3   2   1
6
\end{verbatim}

\subsubsection*{Output}
\label{sec-6-4-2}
\begin{center}
\begin{tabular}{rrr}
A & : & \\
9 & 8 & 7\\
6 & 5 & 4\\
3 & 2 & 1\\
 &  & \\
B: &  & \\
54 & 48 & 42\\
36 & 30 & 24\\
18 & 12 & 6\\
\end{tabular}
\end{center}

\section{Matrix transpose}
\label{sec-7}

Define a function \texttt{mat\_transpose (a, b, m, n)} that
assigns the transpose of a \texttt{m x n} matrix \texttt{a} to matrix
\texttt{b}. 

The algorithm for transposing a matrix is
\linespread{1}
\begin{verbatim}
mat_transpose (a, b)
  for i := 0 to m-1
    for j := 0 to n-1
       b[j,i] := a[i,j]
\end{verbatim}
\linespread{1.2}
It takes two parameters: an input matrix \texttt{a} and an output
matrix \texttt{b} in which the result is stored.  Thus, the
function intends to use \texttt{a} as a read parameter and \texttt{b} as
a write paratemeter.
\linespread{1}
\linespread{1.2}
However, since arrays are passed by reference, actually
both \texttt{a} and \texttt{b} are writeable. If someone calls the
function as
\begin{verbatim}
mat_transpose (a, a, m, n)
\end{verbatim}
in which \texttt{a} is read and written, the specification will
not be satisfied.  To avoid \texttt{a} being used for read and
write simultaneously, we have to use a temporary matrix to
store the transpose and, after the transpose is
constructed completely, copy it in the output array.

\linespread{1}
\linespread{1.2}
\subsection*{Alogrithm}
\label{sec-7-1}
\begin{verbatim}
def mat_copy(a,b,m,n):
  for i in range(m):
    for j in range(n):
      b[j[i]=a[i][j]
\end{verbatim}
\subsection*{Specification}
\label{sec-7-2}
\begin{enumerate}
\item \texttt{mat\_read()}:
\item input: a[][], a 2D integer array, rows, and coloumns.
\item output: \texttt{a[0:m][0:n]} with values in m rows and n columns.
\item \texttt{mat\_print()}:
\item input: \texttt{a[][]}, a 2D integer array, and dimensions of the matrix
\item output: none.
\item \texttt{mat\_transpose()}:
\item input: \texttt{a[][],b[][]}, 2D integer arrays of dimensions mxn
\item output: \texttt{b[0:m][0:n]} ,such that \texttt{b[j][i]=a[i][j]}
\end{enumerate}
\subsection*{Program}
\label{sec-7-3}
\begin{verbatim}
#include<stdio.h>
void mat_read (int a[50][50], int m, int n)
 {
 for(int i=0;i<m;i++)
     for(int j=0;j<n;j++)
       scanf("%d",&a[i][j]);
}
void mat_print(int a[50][50],int m,int n)
{
 for(int i=0;i<m;i++)
  {
   for(int j=0;j<n;j++)
     printf("%d ",a[i][j]);
   printf("\n");
  }
}
void mat_copy(int a[50][50],int b[50][50],int m,int n)
{
for(int i=0;i<m;i++)
     for(int j=0;j<n;j++)
      b[j][i]=a[i][j];
}
int main()
{
int a[50][50],b[50][50];
int m,n;
 scanf("%d%d",&m,&n);
mat_read(a,m,n);
mat_read(b,m,n);
printf("A :\n");
mat_print(a,m,n);
mat_copy(a,b,m,n);
printf("\nB:\n");
mat_print(b,n,m);
return 0;
}
\end{verbatim}
\subsection*{Test}
\label{sec-7-4}
\subsubsection*{Input}
\label{sec-7-4-1}
\begin{verbatim}
 4 5
 1   2   3   4   5 
 6   7   8   9  10 
11  12  13  14  15 
16  17  18  19  20
\end{verbatim}

\subsubsection*{Output}
\label{sec-7-4-2}
\begin{center}
\begin{tabular}{rrrrr}
A & : &  &  & \\
1 & 2 & 3 & 4 & 5\\
6 & 7 & 8 & 9 & 10\\
11 & 12 & 13 & 14 & 15\\
16 & 17 & 18 & 19 & 20\\
 &  &  &  & \\
B: &  &  &  & \\
1 & 6 & 11 & 16 & \\
2 & 7 & 12 & 17 & \\
3 & 8 & 13 & 18 & \\
4 & 9 & 14 & 19 & \\
5 & 10 & 15 & 20 & \\
\end{tabular}
\end{center}

\section{Matrix multiplication}
\label{sec-8}
Define a function \texttt{mat\_mul (a, b, c, m, n, p)} that
multplies an \texttt{m x n} matrix \texttt{a} and an \texttt{n x p} matrix \texttt{b}
and assigns the result to a \texttt{m x p} matrix \texttt{c}.

The algorithm for matrix multiplication is as follows.
\linespread{1}
\begin{verbatim}
matrix_add (a, b, c)
  for i := 0 to m-1
    for j := 0 to p-1
       // dot product of row i and column j
       c[i,j] := 0;
       for k := 0 to n-1:
          c[i,j] := a[i,k] + b [k,j]
\end{verbatim}
\linespread{1.2}
To avoid writing \texttt{a} or \texttt{b}, produce the result in a
temporary array \texttt{d}, and after the result is completely
produced, save it in \texttt{c}.
\linespread{1}
\subsection*{Alogrithm}
\label{sec-8-1}
\begin{verbatim}
def mat_copy(a,b,c,m,q,p):
  for i in range(m):
    for j in range(q):
        c[i][j]=0
        for k in range(p):
          c[i][j]+=a[i][k]*b[k][j]
\end{verbatim}
\subsection*{Specification}
\label{sec-8-2}
\begin{enumerate}
\item \texttt{mat\_read()}:
\item input: a[][], a 2D integer array, rows, and coloumns.
\item output: \texttt{a[0:m][0:n]} with values in m rows and n columns.
\item \texttt{mat\_print()}:
\item input: \texttt{a[][]}, a 2D integer array, and dimensions of the matrix
\item output: none.
\item \texttt{mat\_multiply()}:
\item input: \texttt{a[][],b[][],c[][]}, 2D integer arrays of dimensions mxn and pxq
\item output: \texttt{b[0:m][0:n]} ,such that c=axb.
\end{enumerate}
