ex07_1/ex07-no-code.org
** Program
#+BEGIN_SRC C :cmdline <Ex07_8_input.in
#include<stdio.h>
void mat_read (int a[50][50], int m, int n)
 {
 for(int i=0;i<m;i++)
     for(int j=0;j<n;j++)
       scanf("%d",&a[i][j]);
}
void mat_print(int a[50][50],int m,int n)
{
 for(int i=0;i<m;i++)
  {
   for(int j=0;j<n;j++)
     printf("%d ",a[i][j]);
   printf("\n");
  }
}
void mat_mul(int a[50][50],int b[50][50],int c[50][50],int m,int q,int n)
 {
  for(int i=0;i<m;i++)
   {
       for(int j=0;j<q;j++)
          {
            c[i][j]=0;
            for(int k=0;k<n;k++)
                c[i][j]+=a[i][k]*b[k][j];
          } 
  }
}
int main()
{
 int a[50][50],b[50][50],c[50][50],m,n,p,q;
 scanf("%d%d",&m,&n);
 mat_read(a,m,n);
scanf("%d%d",&p,&q);
mat_read(b,p,q);
 mat_mul(a,b,c,m,q,n);
printf("A:\n");
mat_print(a,m,n);
printf("B:\n");
mat_print(b,p,q);
printf("C:\n");
mat_print(c,m,q);
return 0;
} 
  
#+END_SRC
** Test
*** Input
    #+BEGIN_EXAMPLE
     3 3
   1    2   3 
   4    5   6 
   7    8   9 
  3 3        
   9    8   7 
   6    5   4 
   3    2   1 
    #+END_EXAMPLE
*** Output
#+RESULTS:
|  A: |     |    |
|   1 |   2 |  3 |
|   4 |   5 |  6 |
|   7 |   8 |  9 |
|  B: |     |    |
|   9 |   8 |  7 |
|   6 |   5 |  4 |
|   3 |   2 |  1 |
|  C: |     |    |
|  30 |  24 | 18 |
|  84 |  69 | 54 |
| 138 | 114 | 90 |
